www/mac.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>mac</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="mac"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-07-09 12:32:08 CST"/>
<meta name="author" content="dirtysalt"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="./site.css" />

</head>
<body><script type="text/javascript">var _bdhmProtocol = (("https:" == document.location.protocol) ? " https://" : " http://");document.write(unescape("%3Cscript src='" + _bdhmProtocol + "hm.baidu.com/h.js%3F54a700ad7035f6e485eaf2300641e7e9' type='text/javascript'%3E%3C/script%3E"));</script><!-- Baidu Button BEGIN --><div id="bdshare" class="bdshare_t bds_tools get-codes-bdshare"><a class="bds_tsina"></a><span class="bds_more"></span><a class="shareCount"></a></div><script type="text/javascript" id="bdshare_js" data="type=tools&amp;uid=6762177" ></script><script type="text/javascript" id="bdshell_js"></script><script type="text/javascript">document.getElementById("bdshell_js").src = "http://bdimg.share.baidu.com/static/js/shell_v2.js?cdnversion=" + Math.ceil(new Date()/3600000)</script><!-- Baidu Button END -->

<div id="preamble">

</div>

<div id="content">
<h1 class="title">mac</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 mac</a>
<ul>
<li><a href="#sec-1-1">1.1 软件</a></li>
<li><a href="#sec-1-2">1.2 FAQ</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 截屏</a></li>
<li><a href="#sec-1-2-2">1.2.2 触控板和键盘</a></li>
<li><a href="#sec-1-2-3">1.2.3 控制休眠</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> mac</h2>
<div class="outline-text-2" id="text-1">

<p>相对ubuntu来说，mac还是非常容易上手的。我相信同学的说法:"你拿到的是世界上最好的笔记本"
</p>
<p>
<b>NOTE（dirlt@2013-01-22）：但是从买来到现在，我主要用它阅读一些文档浏览一些网页而没有在上面做开发。开发还是觉得linux好点</b>
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 软件</h3>
<div class="outline-text-3" id="text-1-1">

<p>mac软件还是非常齐全的，我大致安装了下面这些东西:
</p>
<p>
下面软件是通过手动下载dmg安装的:
</p><ul>
<li>evernote
</li>
<li>auqamacs # emacs for mac
<ul>
<li>但是一些功能似乎存在问题，可能是因为基于emacs22开发
</li>
<li>现在自己使用的还是brew安装的emacs24，还算良好。
</li>
</ul>

</li>
<li>firefox
</li>
<li>thunderbird
</li>
<li>adium # gtalk
</li>
<li>brew # apt-get for mac
</li>
<li>xcode # prerequisite for brew，这个通过app store安装的。
</li>
<li>xcode-command-lines # 这个通过xcode内部插件安装的。
</li>
<li>qq
</li>
<li>有道词典
</li>
<li>tunnelblick # openvpn似乎在mac下面似乎有bug
<ul>
<li>但是感觉没有openvpn好用，而且非常容易断开。
</li>
</ul>

</li>
</ul>


<p>
下面软件是通过homebrew自动安装的:
</p><ul>
<li>brew install openvpn
</li>
<li>brew install emacs &ndash;cocoa &ndash;srgb
</li>
<li>brew install svn &ndash;unicode-path
</li>
</ul>


<p>
brew的常用选项有下面这些：
</p><ul>
<li>brew search &lt;package&gt; # 搜索package
</li>
<li>brew install &lt;package&gt; # 安装package
</li>
<li>brew options &lt;package&gt; # 查看package安装选项
</li>
</ul>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> FAQ</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> 截屏</h4>
<div class="outline-text-4" id="text-1-2-1">

<p>使用Command+Shift+4可以进行截屏，ESC可以退出，截图会保存在桌面上。
</p>
</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> 触控板和键盘</h4>
<div class="outline-text-4" id="text-1-2-2">

<p>系统偏好设置下面:
</p><ul>
<li>触控板 设置"轻拍来点按"，不然每次左键都要用力按下
</li>
<li>键盘
<ul>
<li>键盘快捷键 关闭spotlight的快捷键，键盘与文本输入将"选择上一个输入源"绑定
到Ctrl+Space。这样比较容易适合windows用户，因为windows下面输入法使用这个快
捷键进行切换的。
</li>
<li>键盘修饰键 暂时没有什么修改。不过感觉command和option有点串!这点有点不太习
惯，需要一段时间适应一下。
</li>
</ul>

</li>
</ul>


</div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> 控制休眠</h4>
<div class="outline-text-4" id="text-1-2-3">

<ul>
<li>系统偏好设置=》节能器
</li>
<li>电池模式下面使用默认配置
</li>
<li>电源适配器下面使用默认配置，然后修改”电脑进入睡眠“为”永不“
</li>
</ul>

</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-07-09 12:32:08 CST</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
<html><body>
<script type="text/javascript">
var _bdhmProtocol = (("https:" == document.location.protocol) ? " https://" : " http://");
document.write(unescape("%3Cscript src='" + _bdhmProtocol + "hm.baidu.com/h.js%3F54a700ad7035f6e485eaf2300641e7e9' type='text/javascript'%3E%3C/script%3E"));
</script></body></html>
